openwsn-berkeley/openwsn-fw/bsp/boards/mimsy2-cc2538/uartstdio.c
#ifdef UART_BUFFERED
//*****************************************************************************
//
// The list of possible interrupts for the console UART.
//
//*****************************************************************************
static const uint32_t g_ui32UARTInt[2] = 
{
    INT_UART0, INT_UART1
};

//*****************************************************************************
//
// The port number in use.
//
//*****************************************************************************
static uint32_t g_ui32PortNum; 
#endif

//*****************************************************************************
//
// The list of UART peripherals.
//
//*****************************************************************************
static const uint32_t g_ui32UARTPeriph[2] = 
{
    SYS_CTRL_PERIPH_UART0, SYS_CTRL_PERIPH_UART1
};

//*****************************************************************************
//
//! Determines whether the ring buffer whose pointers and size are provided
//! is full or not.
//!
//! \param pui32Read points to the read index for the buffer. 
//! \param pui32Write points to the write index for the buffer. 
//! \param ui32Size is the size of the buffer in bytes. 
//!
//! This function is used to determine whether or not a given ring buffer is
//! full.  The structure of the code is specifically to ensure that we do not
//! see warnings from the compiler related to the order of volatile accesses
//! being undefined.
//!
//! \return Returns \b true if the buffer is full or \b false otherwise.
//
//*****************************************************************************
#ifdef UART_BUFFERED
static bool 
IsBufferFull(volatile uint32_t *pui32Read, 
             volatile uint32_t *pui32Write, uint32_t ui32Size) 
{
    uint32_t ui32Write; 
    uint32_t ui32Read; 

    ui32Write = *pui32Write; 
    ui32Read = *pui32Read; 

    return((((ui32Write + 1) % ui32Size) == ui32Read) ? true : false); 
}
#endif

//*****************************************************************************
//
//! Determines whether the ring buffer whose pointers and size are provided
//! is empty or not.
//!
//! \param pui32Read points to the read index for the buffer. 
//! \param pui32Write points to the write index for the buffer. 
//!
//! This function is used to determine whether or not a given ring buffer is
//! empty.  The structure of the code is specifically to ensure that we do not
//! see warnings from the compiler related to the order of volatile accesses
//! being undefined.
//!
//! \return Returns \b true if the buffer is empty or \b false otherwise.
//
//*****************************************************************************
#ifdef UART_BUFFERED
static bool 
IsBufferEmpty(volatile uint32_t *pui32Read, 
              volatile uint32_t *pui32Write) 
{
    uint32_t ui32Write; 
    uint32_t ui32Read; 

    ui32Write = *pui32Write; 
    ui32Read = *pui32Read; 

    return((ui32Write  == ui32Read) ? true : false); 
}
#endif

//*****************************************************************************
//
//! Determines the number of bytes of data contained in a ring buffer.
//!
//! \param pui32Read points to the read index for the buffer. 
//! \param pui32Write points to the write index for the buffer. 
//! \param ui32Size is the size of the buffer in bytes. 
//!
//! This function is used to determine how many bytes of data a given ring
//! buffer currently contains.  The structure of the code is specifically to
//! ensure that we do not see warnings from the compiler related to the order
//! of volatile accesses being undefined.
//!
//! \return Returns the number of bytes of data currently in the buffer.
//
//*****************************************************************************
#ifdef UART_BUFFERED
static uint32_t 
GetBufferCount(volatile uint32_t *pui32Read, 
               volatile uint32_t *pui32Write, uint32_t ui32Size) 
{
    uint32_t ui32Write; 
    uint32_t ui32Read; 

    ui32Write = *pui32Write; 
    ui32Read = *pui32Read; 

    return((ui32Write >= ui32Read) ? (ui32Write - ui32Read) : 
                                 (ui32Size - (ui32Read - ui32Write))); 
}
#endif

//*****************************************************************************
//
// Take as many bytes from the transmit buffer as we have space for and move
// them into the UART transmit FIFO.
//
//*****************************************************************************
#ifdef UART_BUFFERED
static void
UARTPrimeTransmit(uint32_t ui32Base) 
{
    //
    // Do we have any data to transmit?
    //
    if(!TX_BUFFER_EMPTY)
    {
        //
        // Disable the UART interrupt. If we don't do this there is a race
        // condition which can cause the read index to be corrupted.
        //
        IntDisable(g_ui32UARTInt[g_ui32PortNum]); 

        //
        // Yes - take some characters out of the transmit buffer and feed
        // them to the UART transmit FIFO.
        //
        while(UARTSpaceAvail(ui32Base) && !TX_BUFFER_EMPTY) 
        {
            UARTCharPutNonBlocking(ui32Base, 
                                   g_pcUARTTxBuffer[g_ui32UARTTxReadIndex]); 
            ADVANCE_TX_BUFFER_INDEX(g_ui32UARTTxReadIndex); 
        }

        //
        // Reenable the UART interrupt.
        //
        IntEnable(g_ui32UARTInt[g_ui32PortNum]); 
    }
}
#endif

//*****************************************************************************
//
//! Configures the UART console.
//!
//! \param ui32PortNum is the number of UART port to use for the serial console 
//! (0-1)
//! \param ui32Baud is the bit rate that the UART is to be configured to use. 
//! \param ui32SrcClock is the frequency of the source clock for the UART module. 
//!
//! This function will configure the specified serial port to be used as a
//! serial console.  The serial parameters are set to the baud rate
//! specified by the \e ui32Baud parameter and use 8 bit, no parity, and 1 stop 
//! bit.
//!
//! This function must be called prior to using any of the other UART console
//! functions: UARTprintf() or UARTgets().  This function assumes that the
//! caller has previously configured the relevant UART pins for operation as a
//! UART rather than as GPIOs.
//!
//! \return None.
//
//*****************************************************************************
void
UARTStdioConfig(uint32_t ui32PortNum, uint32_t ui32Baud, 
                uint32_t ui32SrcClock) 
{
    //
    // Check the arguments.
    //
    ASSERT((ui32PortNum == 0) || (ui32PortNum == 1)); 

